[[{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational thinking and its applications to the arts and social sciences.  Students will gain computational thinking skills by exploring data representation, basic programming concepts, a selection of algorithms, and advanced usage of software packages for the arts and social sciences.", "\n"], "title": "Introduction to Computational Thinking for Arts and Social Science Students", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nWorking knowledge of computers and their applications with particular reference to problems in Science. Computer fundamentals and the use of application packages such as spreadsheets, databases and symbolic Mathematics programs. A basic familiarity with computers is assumed.", "\n"], "title": "Introduction to Computers for the Sciences", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming, emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1006"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming for B.C.S. students emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1405"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming for BCS students, emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to computer game programming interfaces. Topics may include: game balance and level design; storytelling and narrative; basic game architecture; sprite-based games and isometric games; representation of scenes; user interaction; architecture of game consoles; development tools for game consoles; interaction with game peripherals.", "\n"], "title": "Introduction to Computer Game Design", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to developing mobile applications using the Mac OS X platform.  Topics include: the Objective-C programming language; development tools; framework API's; and the Quartz graphic system. Extensive practical experience with development for Apple mobile devices such as the iPhone.", "\n"], "title": "Introduction to Mobile Application Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 1805"], "description": ["\n", "\nIntroduction to discrete mathematics and discrete structures. Topics include: propositional logic, predicate calculus, set theory, complexity of algorithms, mathematical reasoning and proof techniques, recurrences, induction, finite automata and graph theory. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1805"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to the field of mobile robots and their applications from a computer science perspective.  The course will discuss common robot programming architectures and strategies. Students will build various robot configurations and experiment with a variety of sensors using behavior-based programming.", "\n"], "title": "Introduction to Robotics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to system-level programming with fundamental OS concepts, procedures, primitive data types, user-defined types. Topics may include process management, memory management, process coordination and synchronization, inter-process communication, file systems, networking, pointers, heap and stack memory management, and system/library calls.", "\n"], "title": "Introduction to Systems Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2401"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the design and implementation of abstract data types and to complexity analysis of data structures. Topics include: stacks, queues, lists, trees and graphs. Special attention is given to abstraction, interface specification and hierarchical design using an object-oriented programming language.", "\n"], "title": "Abstract Data Types and Algorithms", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2402"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to object-oriented software development, with emphasis on design and implementation of medium-sized programs. Topics include abstraction, modularity, encapsulation, reusability, and design patterns.", "\n"], "title": "Introduction to Software Engineering", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2404"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to Internet application development; emphasis on computer science fundamentals of technologies underlying web applications. Topics include: scripting and functional languages, language-based virtual machines, database query languages, remote procedure calls over the Internet, and performance and security concerns in modern distributed applications.", "\n"], "title": "Fundamentals of Web Applications", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTopics may include: user interaction in multiplayer games, representation of animated scenes, tools for game character development, special effects,  sound programming, game AI,  motion planning and control, collision detection and physics, digital rights management.", "\n"], "title": "Computer Game Design and Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nDevelopment of applications for mobile environments taking advantage of gesture-based input and using location and presence services. Topics include introduction to low-level network services and mobile platforms, description of architectural patterns, principles of mobile development and interaction styles for network service usage.", "\n"], "title": "Mobile Applications", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in discrete mathematics and discrete structures. Topics include: counting, sequences and sums, discrete probability, basic statistics, recurrence relations, randomized algorithms. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2804"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA continuation of ", ", this course will focus on data uncertainty and various timing issues inherent to the field of mobile robot programming. Topics may include position estimation, forward/inverse kinematics, navigation, data-logging, mapping and robot-computer interaction through wireless communication.", "\n"], "title": "Fundamentals of Mobile Robot Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOperating system implementation course stressing fundamental issues in design and how they relate to modern computer architectures. Assignments involve the modification and extension of a multitasking operating system.", "\n"], "title": "Operating Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe structure, organization and design of the phases of a compiler are considered: lexical translators, syntactical translators, scope handlers, type checkers, code generators and optimizers. Components of a compiler will be implemented.", "\n"], "title": "Compiler Construction", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheory and development software systems. Computer ethics. Possible topics include: software development processes, requirement specification, class and scenario modeling, state modeling, UML, design patterns, traceability. Students are to complete a team project using a CASE tool.", "\n"], "title": "Oriented Software Engineering", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduces students to concepts of database management systems, database design and file structures. Topics include: entity-relationship modeling and object oriented database design, data models (relational, network and object oriented), the relational algebra, SQL, normalization theory, physical data organization, object oriented databases and OQL.", "\n"], "title": "Database Management Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to alternative programming paradigms such as functional, constraint-based, concurrent, and logic programming.", "\n"], "title": "Programming Paradigms", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3007"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamentals of the underlying theories, design principles, development and evaluation practices of human-computer interaction (HCI). Topics may include: theories of interaction, user interface frameworks, desktop, web, mobile, and immersive applications, usability inspection and testing methods, and qualitative and quantitative approaches to HCI research.", "\n"], "title": "Computer Interaction", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3008"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn overview of computer graphics covering rendering, modeling, and animation. Topics include geometric primitives and modeling; image formation algorithms such as ray tracing and the Z-buffer; lighting, shading, and texture; and introduction to physics-based animation and character animation.", "\n"], "title": "Computer Graphics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThis is an introductory course to the field of Network Computing. Topics include: Protocol Architectures and Internetworking, Types of Networks, Communication Protocols, End-System and Network Traffic Management, Structure of Routing and Congestion Control.", "\n"], "title": "Principles of Computer Networks", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTechnical communication for computer science majors, concentrating on writing scientific papers and technical reports. Principles of clarity and precision in writing and communication. Practical exercises and readings from recent technical publications will be used.", "\n"], "title": "Technical Writing for Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3301"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 3008"], "description": ["\n", "\nThis practical interdisciplinary course will provide a broad overview of bioinformatics in which computer science and mathematics are applied to solve problems in molecular biology. Topics include gene prediction, sequence alignment, phylogeny, molecular interactions, macromolecular structure prediction and biological databases.", "\n"], "title": "Bioinformatics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplications of formal logic in computer science. Symbolic logics such as classical predicate calculus are used to represent domain knowledge, to model computational problems and to solve them by means of automated reasoners. Applications include artificial intelligence, software engineering, data management and hardware verification.", "\n"], "title": "Computational Logic and Automated Reasoning", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3400"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nMathematical concepts of 3D engines. Topics may include: illumination and visibility determination; quaternions; homogeneous coordinates; transforms; ray tracing; bump mapping; portal systems; polygonal techniques; shadows; and linear and rotational physics.", "\n"], "title": "Foundations of Game Programming and Computer Graphics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to virtual communities, overlay networks and social networking. Topics include architectural principles for heterogeneous social networking platforms, trust and reputation as social concepts, agent-based computing, and extraction of trends and patterns from information exchanged between community members.", "\n"], "title": "Social Networking", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAlgorithm design techniques for modern data sets arising in, for example, data mining, web analytics, epidemic spreads, search engines and social networks. Topics may include streaming, memory hierarchy aware, game theoretic, parallel, distributed, cloud-based, and probabilistic algorithms.", "\n"], "title": "Algorithms for Modern Data Sets", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3801"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational geometry focusing on applications to autonomous mobile robots. Topics may include planning, probabilistic roadmaps, search strategies, coverage algorithms, watchman routes, vision-based landmark identification and multi-robot applications.", "\n"], "title": "Computational Geometry", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3802"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheoretical aspects of computer science. Topics include: formal languages and automata theory, computability theory.", "\n"], "title": "Introduction to Theory of Computation", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3803"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3804"], "description": ["\n", "\nAn introduction to the design and analysis of algorithms. Topics include: divide-and-conquer, dynamic programming, linear programming, greedy algorithms, graph algorithms, NP-completeness.", "\n"], "title": "Design and Analysis of Algorithms I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3855"], "description": ["\n", "\nEnumeration: inclusion and exclusion, recurrence relations, generating functions and applications. Graph theory: connectivity, planarity, Hamilton paths and Euler trails. Error-correcting codes. Designs and finite geometries. Symmetry and counting.", "\n"], "title": "", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3806"], "description": ["\n", "\nElementary discussion of error, polynomial interpolation, quadrature, linear systems of equations and matrix inversion, non-linear equations, difference equations and ordinary differential equations.", "\n"], "title": "Numerical Analysis", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3806"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3807"], "description": ["\n", "\nIncorporation of basic numerical methods into efficient, reliable software. The course includes examination of existing software systems, e.g. linear systems, non-linear systems, optimization, or differential equations.", "\n"], "title": "Mathematical Software", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\n"], "title": "operative Work Term", "prerequisites": [], "credit": ["0.0"], "code": ["COMP 3999"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn advanced course emphasizing the principles of distributed operating systems including networking protocols, distributed file systems, remote IPC mechanisms, graphical user interfaces, load balancing, and process migration. Case studies include current \"standards\" as well as novel systems under development.", "\n"], "title": "Distributed Operating Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOverview of distributed computing. Topics include: computational models, communication complexity, design and analysis of distributed algorithms and protocols, fault-tolerant protocols, synchronous computations. Applications may include: communication in data networks, control in distributed system (e.g., election, distributed mutual exclusion), manipulation of distributed data (e.g., ranking).", "\n"], "title": "Distributed Computing", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe design and implementation of game engines for real-time 3D games including topics such as camera control, environmental effects, articulated models, terrain, vegetation, collision detection, particles, emitters, triggers, portals, waypoints, mirrors, and shadows.", "\n"], "title": "Time 3D Game Engines", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nConcepts and architectures of transaction processing systems and on-line transaction processing, with emphasis on data integration systems. Transaction properties and models, embedded-SQL, active rules, consistency maintenance, serializability, concurrency control, recovery, data integration systems and federated databases, introduction to transactions in web services and workflow systems.", "\n"], "title": "Transaction Processing Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4003"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and practice of Software Quality Assurance. Topics include: functional requirements analysis, system requirement analysis, verification and validation, traceability, white box testing, integration testing, object-oriented testing, tools, and management issues.", "\n"], "title": "Software Quality Assurance", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to parallel architectures, programming languages and algorithms for processor clusters and multi-core processors. Distributed memory architectures, cluster computing, message passing parallel programming, multi-core processors, shared memory parallel programming, use of thread libraries, parallel performance analysis.", "\n"], "title": "Core Processors", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe basic ideas and techniques of computer vision. The central theme is reconstructing 3D models from 2D images. Topics include: image formation, image feature extraction, camera models, camera calibration, structure from motion, stereo, recognition, augmented reality, image searching.", "\n"], "title": "Computer Vision", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4102"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAdvanced course on distributed programming in Java. Introduces students to standard design patterns for implementing components that solve common distributed programming challenges in Java. Topics covered include: threads, message passing, coordination, distributed object technology, web-based services, and collaborative applications.", "\n"], "title": "Principles and Practice of Distributed Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4104"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSeveral areas in knowledge-based systems are covered, including recent approaches to machine learning and data mining, inference methods, knowledge-based and fuzzy systems, heuristic search, and natural language processing.", "\n"], "title": "Artificial Intelligence", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4106"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and application of naturally-occurring systems for the purpose of creating computer algorithms. Topics from evolutionary computing, swarm intelligence, neural networks and artificial immune systems will be studied.", "\n"], "title": "Inspired Computing", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4107"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to information security in computer and communications systems, including network, operating systems, web and software security; Passwords, authentication applications, privacy, data integrity, anonymity, secure email, IP security, security infrastructures, firewalls, viruses, intrusion detection, network attacks.", "\n"], "title": "Computer Systems Security", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4108"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nPractical aspects of cryptography. Pseudo random number generation, symmetric cryptography (stream and block ciphers), modes of operation, hash functions, message and entity authentication protocols, zero knowledge, pitfalls deploying public-key encryption and digital signatures, key distribution, secret-sharing.", "\n"], "title": "Applied Cryptography", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4109"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplication of computational techniques to support business activities, such as decision making, business understanding, data analysis, business process automation, learning from data, producing and using data-centric business models, ontology-based data access and integration, data quality assessment and cleaning and use of contextual data.", "\n"], "title": "Data Management for Business Intelligence", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4111"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to wireless networks covering both networking issues and security aspects of modern wireless environments. Fundamentals of mobile LANs, ad hoc, sensor networks, secure routing, searching, clustering, multicasting, localization, mobile IP/TCP, confidentiality, key establishment, authentication, broadcasting, RFIDs, and rogue attacks.", "\n"], "title": "Wireless Networks and Security", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamental mathematical and algorithmic concepts underlying molecular computational biology; physical and genetic mapping, sequence analysis (including alignment and probabilistic models), genomic rearrangements, phylogenetic inference, computational proteomics and systemic modeling of the whole cell.", "\n"], "title": "Computational Molecular Biology", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4300"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 4008"], "description": ["\n", "\nModeling and simulation of metabolic and regulatory networks towards understanding complex and highly dynamic cellular systems. Biotechnological applications include metabolic engineering, synthetic biology, and drug discovery.", "\n"], "title": "Computational Systems Biology", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected computer game topics including: networked games; online games; high performance computing for game development; high resolution scenes; massively multiplayer online games (MMOG); advanced character development; facial modeling and animation; the computer games marketplace and business models.", "\n"], "title": "Advanced Computer Game Design and Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the creation, delivery and playback of multimedia over high-speed wireless networks on mobile devices. Topics include human computer interaction, standards, interaction with networking aspects, security, video streaming, gaming, navigation and context aware services, and immersive communications in virtual environments.", "\n"], "title": "Mobile Multimedia", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4803"], "description": ["\n", "\nRecursive functions and computability, algorithms, Church's thesis, Turing machines, computational logic, NP-completeness.", "\n"], "title": "Computable Functions", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4803"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course on the design and analysis of algorithms. Topics include: advanced recurrence relations, algebraic complexity, advanced graph algorithms, amortized analysis, algorithms for NP-complete problems, randomized algorithms.", "\n"], "title": "Design and Analysis of Algorithms II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4805"], "description": ["\n", "\nFinite automata and regular expressions, properties of regular sets, context-free grammars, pushdown automata, deterministic context-free languages. Turing machines, the Chomsky hierarchy. Undecidability, intractable problems.", "\n"], "title": "Theory of Automata", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4806"], "description": ["\n", "\nStudy of matrix inversion techniques; techniques of finding eigenvalues and eigenvectors, solution of systems of linear equations; direct and indirect methods, their comparison and error analysis; applications in optimization and other areas.", "\n"], "title": "Numerical Linear Algebra", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4806"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected topics in Computer Science offered by members of the School of Computer Science.", "\n"], "title": "Advanced Topics in Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4900"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA course of independent study under the supervision of a member of the School of Computer Science, open only to students in the B.C.S. program. Students are required to obtain their supervisor's written approval prior to registration and are limited to two such courses in their programs.", "\n"], "title": "Directed Studies", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4901"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nUnder the supervision of a faculty member, Honours students complete a major Computer Science project in fourth year. Permission to register is granted once an approved project proposal is submitted to the Department. See deadlines and details on the School web site.", "\n"], "title": "Honours Project", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4905"]}][{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational thinking and its applications to the arts and social sciences.  Students will gain computational thinking skills by exploring data representation, basic programming concepts, a selection of algorithms, and advanced usage of software packages for the arts and social sciences.", "\n"], "title": "Introduction to Computational Thinking for Arts and Social Science Students", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nWorking knowledge of computers and their applications with particular reference to problems in Science. Computer fundamentals and the use of application packages such as spreadsheets, databases and symbolic Mathematics programs. A basic familiarity with computers is assumed.", "\n"], "title": "Introduction to Computers for the Sciences", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming, emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1006"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming for B.C.S. students emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1405"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming for BCS students, emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to computer game programming interfaces. Topics may include: game balance and level design; storytelling and narrative; basic game architecture; sprite-based games and isometric games; representation of scenes; user interaction; architecture of game consoles; development tools for game consoles; interaction with game peripherals.", "\n"], "title": "Introduction to Computer Game Design", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to developing mobile applications using the Mac OS X platform.  Topics include: the Objective-C programming language; development tools; framework API's; and the Quartz graphic system. Extensive practical experience with development for Apple mobile devices such as the iPhone.", "\n"], "title": "Introduction to Mobile Application Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 1805"], "description": ["\n", "\nIntroduction to discrete mathematics and discrete structures. Topics include: propositional logic, predicate calculus, set theory, complexity of algorithms, mathematical reasoning and proof techniques, recurrences, induction, finite automata and graph theory. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1805"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to the field of mobile robots and their applications from a computer science perspective.  The course will discuss common robot programming architectures and strategies. Students will build various robot configurations and experiment with a variety of sensors using behavior-based programming.", "\n"], "title": "Introduction to Robotics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to system-level programming with fundamental OS concepts, procedures, primitive data types, user-defined types. Topics may include process management, memory management, process coordination and synchronization, inter-process communication, file systems, networking, pointers, heap and stack memory management, and system/library calls.", "\n"], "title": "Introduction to Systems Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2401"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the design and implementation of abstract data types and to complexity analysis of data structures. Topics include: stacks, queues, lists, trees and graphs. Special attention is given to abstraction, interface specification and hierarchical design using an object-oriented programming language.", "\n"], "title": "Abstract Data Types and Algorithms", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2402"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to object-oriented software development, with emphasis on design and implementation of medium-sized programs. Topics include abstraction, modularity, encapsulation, reusability, and design patterns.", "\n"], "title": "Introduction to Software Engineering", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2404"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to Internet application development; emphasis on computer science fundamentals of technologies underlying web applications. Topics include: scripting and functional languages, language-based virtual machines, database query languages, remote procedure calls over the Internet, and performance and security concerns in modern distributed applications.", "\n"], "title": "Fundamentals of Web Applications", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTopics may include: user interaction in multiplayer games, representation of animated scenes, tools for game character development, special effects,  sound programming, game AI,  motion planning and control, collision detection and physics, digital rights management.", "\n"], "title": "Computer Game Design and Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nDevelopment of applications for mobile environments taking advantage of gesture-based input and using location and presence services. Topics include introduction to low-level network services and mobile platforms, description of architectural patterns, principles of mobile development and interaction styles for network service usage.", "\n"], "title": "Mobile Applications", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in discrete mathematics and discrete structures. Topics include: counting, sequences and sums, discrete probability, basic statistics, recurrence relations, randomized algorithms. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2804"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA continuation of ", ", this course will focus on data uncertainty and various timing issues inherent to the field of mobile robot programming. Topics may include position estimation, forward/inverse kinematics, navigation, data-logging, mapping and robot-computer interaction through wireless communication.", "\n"], "title": "Fundamentals of Mobile Robot Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOperating system implementation course stressing fundamental issues in design and how they relate to modern computer architectures. Assignments involve the modification and extension of a multitasking operating system.", "\n"], "title": "Operating Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe structure, organization and design of the phases of a compiler are considered: lexical translators, syntactical translators, scope handlers, type checkers, code generators and optimizers. Components of a compiler will be implemented.", "\n"], "title": "Compiler Construction", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheory and development software systems. Computer ethics. Possible topics include: software development processes, requirement specification, class and scenario modeling, state modeling, UML, design patterns, traceability. Students are to complete a team project using a CASE tool.", "\n"], "title": "Oriented Software Engineering", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduces students to concepts of database management systems, database design and file structures. Topics include: entity-relationship modeling and object oriented database design, data models (relational, network and object oriented), the relational algebra, SQL, normalization theory, physical data organization, object oriented databases and OQL.", "\n"], "title": "Database Management Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to alternative programming paradigms such as functional, constraint-based, concurrent, and logic programming.", "\n"], "title": "Programming Paradigms", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3007"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamentals of the underlying theories, design principles, development and evaluation practices of human-computer interaction (HCI). Topics may include: theories of interaction, user interface frameworks, desktop, web, mobile, and immersive applications, usability inspection and testing methods, and qualitative and quantitative approaches to HCI research.", "\n"], "title": "Computer Interaction", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3008"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn overview of computer graphics covering rendering, modeling, and animation. Topics include geometric primitives and modeling; image formation algorithms such as ray tracing and the Z-buffer; lighting, shading, and texture; and introduction to physics-based animation and character animation.", "\n"], "title": "Computer Graphics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThis is an introductory course to the field of Network Computing. Topics include: Protocol Architectures and Internetworking, Types of Networks, Communication Protocols, End-System and Network Traffic Management, Structure of Routing and Congestion Control.", "\n"], "title": "Principles of Computer Networks", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTechnical communication for computer science majors, concentrating on writing scientific papers and technical reports. Principles of clarity and precision in writing and communication. Practical exercises and readings from recent technical publications will be used.", "\n"], "title": "Technical Writing for Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3301"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 3008"], "description": ["\n", "\nThis practical interdisciplinary course will provide a broad overview of bioinformatics in which computer science and mathematics are applied to solve problems in molecular biology. Topics include gene prediction, sequence alignment, phylogeny, molecular interactions, macromolecular structure prediction and biological databases.", "\n"], "title": "Bioinformatics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplications of formal logic in computer science. Symbolic logics such as classical predicate calculus are used to represent domain knowledge, to model computational problems and to solve them by means of automated reasoners. Applications include artificial intelligence, software engineering, data management and hardware verification.", "\n"], "title": "Computational Logic and Automated Reasoning", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3400"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nMathematical concepts of 3D engines. Topics may include: illumination and visibility determination; quaternions; homogeneous coordinates; transforms; ray tracing; bump mapping; portal systems; polygonal techniques; shadows; and linear and rotational physics.", "\n"], "title": "Foundations of Game Programming and Computer Graphics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to virtual communities, overlay networks and social networking. Topics include architectural principles for heterogeneous social networking platforms, trust and reputation as social concepts, agent-based computing, and extraction of trends and patterns from information exchanged between community members.", "\n"], "title": "Social Networking", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAlgorithm design techniques for modern data sets arising in, for example, data mining, web analytics, epidemic spreads, search engines and social networks. Topics may include streaming, memory hierarchy aware, game theoretic, parallel, distributed, cloud-based, and probabilistic algorithms.", "\n"], "title": "Algorithms for Modern Data Sets", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3801"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational geometry focusing on applications to autonomous mobile robots. Topics may include planning, probabilistic roadmaps, search strategies, coverage algorithms, watchman routes, vision-based landmark identification and multi-robot applications.", "\n"], "title": "Computational Geometry", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3802"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheoretical aspects of computer science. Topics include: formal languages and automata theory, computability theory.", "\n"], "title": "Introduction to Theory of Computation", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3803"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3804"], "description": ["\n", "\nAn introduction to the design and analysis of algorithms. Topics include: divide-and-conquer, dynamic programming, linear programming, greedy algorithms, graph algorithms, NP-completeness.", "\n"], "title": "Design and Analysis of Algorithms I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3855"], "description": ["\n", "\nEnumeration: inclusion and exclusion, recurrence relations, generating functions and applications. Graph theory: connectivity, planarity, Hamilton paths and Euler trails. Error-correcting codes. Designs and finite geometries. Symmetry and counting.", "\n"], "title": "", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3806"], "description": ["\n", "\nElementary discussion of error, polynomial interpolation, quadrature, linear systems of equations and matrix inversion, non-linear equations, difference equations and ordinary differential equations.", "\n"], "title": "Numerical Analysis", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3806"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3807"], "description": ["\n", "\nIncorporation of basic numerical methods into efficient, reliable software. The course includes examination of existing software systems, e.g. linear systems, non-linear systems, optimization, or differential equations.", "\n"], "title": "Mathematical Software", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\n"], "title": "operative Work Term", "prerequisites": [], "credit": ["0.0"], "code": ["COMP 3999"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn advanced course emphasizing the principles of distributed operating systems including networking protocols, distributed file systems, remote IPC mechanisms, graphical user interfaces, load balancing, and process migration. Case studies include current \"standards\" as well as novel systems under development.", "\n"], "title": "Distributed Operating Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOverview of distributed computing. Topics include: computational models, communication complexity, design and analysis of distributed algorithms and protocols, fault-tolerant protocols, synchronous computations. Applications may include: communication in data networks, control in distributed system (e.g., election, distributed mutual exclusion), manipulation of distributed data (e.g., ranking).", "\n"], "title": "Distributed Computing", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe design and implementation of game engines for real-time 3D games including topics such as camera control, environmental effects, articulated models, terrain, vegetation, collision detection, particles, emitters, triggers, portals, waypoints, mirrors, and shadows.", "\n"], "title": "Time 3D Game Engines", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nConcepts and architectures of transaction processing systems and on-line transaction processing, with emphasis on data integration systems. Transaction properties and models, embedded-SQL, active rules, consistency maintenance, serializability, concurrency control, recovery, data integration systems and federated databases, introduction to transactions in web services and workflow systems.", "\n"], "title": "Transaction Processing Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4003"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and practice of Software Quality Assurance. Topics include: functional requirements analysis, system requirement analysis, verification and validation, traceability, white box testing, integration testing, object-oriented testing, tools, and management issues.", "\n"], "title": "Software Quality Assurance", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to parallel architectures, programming languages and algorithms for processor clusters and multi-core processors. Distributed memory architectures, cluster computing, message passing parallel programming, multi-core processors, shared memory parallel programming, use of thread libraries, parallel performance analysis.", "\n"], "title": "Core Processors", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe basic ideas and techniques of computer vision. The central theme is reconstructing 3D models from 2D images. Topics include: image formation, image feature extraction, camera models, camera calibration, structure from motion, stereo, recognition, augmented reality, image searching.", "\n"], "title": "Computer Vision", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4102"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAdvanced course on distributed programming in Java. Introduces students to standard design patterns for implementing components that solve common distributed programming challenges in Java. Topics covered include: threads, message passing, coordination, distributed object technology, web-based services, and collaborative applications.", "\n"], "title": "Principles and Practice of Distributed Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4104"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSeveral areas in knowledge-based systems are covered, including recent approaches to machine learning and data mining, inference methods, knowledge-based and fuzzy systems, heuristic search, and natural language processing.", "\n"], "title": "Artificial Intelligence", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4106"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and application of naturally-occurring systems for the purpose of creating computer algorithms. Topics from evolutionary computing, swarm intelligence, neural networks and artificial immune systems will be studied.", "\n"], "title": "Inspired Computing", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4107"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to information security in computer and communications systems, including network, operating systems, web and software security; Passwords, authentication applications, privacy, data integrity, anonymity, secure email, IP security, security infrastructures, firewalls, viruses, intrusion detection, network attacks.", "\n"], "title": "Computer Systems Security", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4108"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nPractical aspects of cryptography. Pseudo random number generation, symmetric cryptography (stream and block ciphers), modes of operation, hash functions, message and entity authentication protocols, zero knowledge, pitfalls deploying public-key encryption and digital signatures, key distribution, secret-sharing.", "\n"], "title": "Applied Cryptography", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4109"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplication of computational techniques to support business activities, such as decision making, business understanding, data analysis, business process automation, learning from data, producing and using data-centric business models, ontology-based data access and integration, data quality assessment and cleaning and use of contextual data.", "\n"], "title": "Data Management for Business Intelligence", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4111"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to wireless networks covering both networking issues and security aspects of modern wireless environments. Fundamentals of mobile LANs, ad hoc, sensor networks, secure routing, searching, clustering, multicasting, localization, mobile IP/TCP, confidentiality, key establishment, authentication, broadcasting, RFIDs, and rogue attacks.", "\n"], "title": "Wireless Networks and Security", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamental mathematical and algorithmic concepts underlying molecular computational biology; physical and genetic mapping, sequence analysis (including alignment and probabilistic models), genomic rearrangements, phylogenetic inference, computational proteomics and systemic modeling of the whole cell.", "\n"], "title": "Computational Molecular Biology", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4300"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 4008"], "description": ["\n", "\nModeling and simulation of metabolic and regulatory networks towards understanding complex and highly dynamic cellular systems. Biotechnological applications include metabolic engineering, synthetic biology, and drug discovery.", "\n"], "title": "Computational Systems Biology", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected computer game topics including: networked games; online games; high performance computing for game development; high resolution scenes; massively multiplayer online games (MMOG); advanced character development; facial modeling and animation; the computer games marketplace and business models.", "\n"], "title": "Advanced Computer Game Design and Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the creation, delivery and playback of multimedia over high-speed wireless networks on mobile devices. Topics include human computer interaction, standards, interaction with networking aspects, security, video streaming, gaming, navigation and context aware services, and immersive communications in virtual environments.", "\n"], "title": "Mobile Multimedia", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4803"], "description": ["\n", "\nRecursive functions and computability, algorithms, Church's thesis, Turing machines, computational logic, NP-completeness.", "\n"], "title": "Computable Functions", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4803"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course on the design and analysis of algorithms. Topics include: advanced recurrence relations, algebraic complexity, advanced graph algorithms, amortized analysis, algorithms for NP-complete problems, randomized algorithms.", "\n"], "title": "Design and Analysis of Algorithms II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4805"], "description": ["\n", "\nFinite automata and regular expressions, properties of regular sets, context-free grammars, pushdown automata, deterministic context-free languages. Turing machines, the Chomsky hierarchy. Undecidability, intractable problems.", "\n"], "title": "Theory of Automata", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4806"], "description": ["\n", "\nStudy of matrix inversion techniques; techniques of finding eigenvalues and eigenvectors, solution of systems of linear equations; direct and indirect methods, their comparison and error analysis; applications in optimization and other areas.", "\n"], "title": "Numerical Linear Algebra", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4806"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected topics in Computer Science offered by members of the School of Computer Science.", "\n"], "title": "Advanced Topics in Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4900"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA course of independent study under the supervision of a member of the School of Computer Science, open only to students in the B.C.S. program. Students are required to obtain their supervisor's written approval prior to registration and are limited to two such courses in their programs.", "\n"], "title": "Directed Studies", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4901"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nUnder the supervision of a faculty member, Honours students complete a major Computer Science project in fourth year. Permission to register is granted once an approved project proposal is submitted to the Department. See deadlines and details on the School web site.", "\n"], "title": "Honours Project", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4905"]}][{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational thinking and its applications to the arts and social sciences.  Students will gain computational thinking skills by exploring data representation, basic programming concepts, a selection of algorithms, and advanced usage of software packages for the arts and social sciences.", "\n"], "title": "Introduction to Computational Thinking for Arts and Social Science Students", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nWorking knowledge of computers and their applications with particular reference to problems in Science. Computer fundamentals and the use of application packages such as spreadsheets, databases and symbolic Mathematics programs. A basic familiarity with computers is assumed.", "\n"], "title": "Introduction to Computers for the Sciences", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming, emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1005"]},
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTechnical communication for computer science majors, concentrating on writing scientific papers and technical reports. Principles of clarity and precision in writing and communication. Practical exercises and readings from recent technical publications will be used.", "\n"], "title": "Technical Writing for Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3301"]},
,
,
,
,
,
,
,
,
,
,
,
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\n"], "title": "operative Work Term", "prerequisites": [], "credit": ["0.0"], "code": ["COMP 3999"]},
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
,
][{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational thinking and its applications to the arts and social sciences.  Students will gain computational thinking skills by exploring data representation, basic programming concepts, a selection of algorithms, and advanced usage of software packages for the arts and social sciences.", "\n"], "title": "Introduction to Computational Thinking for Arts and Social Science Students", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nWorking knowledge of computers and their applications with particular reference to problems in Science. Computer fundamentals and the use of application packages such as spreadsheets, databases and symbolic Mathematics programs. A basic familiarity with computers is assumed.", "\n"], "title": "Introduction to Computers for the Sciences", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming, emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1006"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming for B.C.S. students emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1405"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming for BCS students, emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to computer game programming interfaces. Topics may include: game balance and level design; storytelling and narrative; basic game architecture; sprite-based games and isometric games; representation of scenes; user interaction; architecture of game consoles; development tools for game consoles; interaction with game peripherals.", "\n"], "title": "Introduction to Computer Game Design", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to developing mobile applications using the Mac OS X platform.  Topics include: the Objective-C programming language; development tools; framework API's; and the Quartz graphic system. Extensive practical experience with development for Apple mobile devices such as the iPhone.", "\n"], "title": "Introduction to Mobile Application Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 1805"], "description": ["\n", "\nIntroduction to discrete mathematics and discrete structures. Topics include: propositional logic, predicate calculus, set theory, complexity of algorithms, mathematical reasoning and proof techniques, recurrences, induction, finite automata and graph theory. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1805"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to the field of mobile robots and their applications from a computer science perspective.  The course will discuss common robot programming architectures and strategies. Students will build various robot configurations and experiment with a variety of sensors using behavior-based programming.", "\n"], "title": "Introduction to Robotics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to system-level programming with fundamental OS concepts, procedures, primitive data types, user-defined types. Topics may include process management, memory management, process coordination and synchronization, inter-process communication, file systems, networking, pointers, heap and stack memory management, and system/library calls.", "\n"], "title": "Introduction to Systems Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2401"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the design and implementation of abstract data types and to complexity analysis of data structures. Topics include: stacks, queues, lists, trees and graphs. Special attention is given to abstraction, interface specification and hierarchical design using an object-oriented programming language.", "\n"], "title": "Abstract Data Types and Algorithms", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2402"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to object-oriented software development, with emphasis on design and implementation of medium-sized programs. Topics include abstraction, modularity, encapsulation, reusability, and design patterns.", "\n"], "title": "Introduction to Software Engineering", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2404"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to Internet application development; emphasis on computer science fundamentals of technologies underlying web applications. Topics include: scripting and functional languages, language-based virtual machines, database query languages, remote procedure calls over the Internet, and performance and security concerns in modern distributed applications.", "\n"], "title": "Fundamentals of Web Applications", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTopics may include: user interaction in multiplayer games, representation of animated scenes, tools for game character development, special effects,  sound programming, game AI,  motion planning and control, collision detection and physics, digital rights management.", "\n"], "title": "Computer Game Design and Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nDevelopment of applications for mobile environments taking advantage of gesture-based input and using location and presence services. Topics include introduction to low-level network services and mobile platforms, description of architectural patterns, principles of mobile development and interaction styles for network service usage.", "\n"], "title": "Mobile Applications", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in discrete mathematics and discrete structures. Topics include: counting, sequences and sums, discrete probability, basic statistics, recurrence relations, randomized algorithms. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2804"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA continuation of ", ", this course will focus on data uncertainty and various timing issues inherent to the field of mobile robot programming. Topics may include position estimation, forward/inverse kinematics, navigation, data-logging, mapping and robot-computer interaction through wireless communication.", "\n"], "title": "Fundamentals of Mobile Robot Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 2807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOperating system implementation course stressing fundamental issues in design and how they relate to modern computer architectures. Assignments involve the modification and extension of a multitasking operating system.", "\n"], "title": "Operating Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe structure, organization and design of the phases of a compiler are considered: lexical translators, syntactical translators, scope handlers, type checkers, code generators and optimizers. Components of a compiler will be implemented.", "\n"], "title": "Compiler Construction", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheory and development software systems. Computer ethics. Possible topics include: software development processes, requirement specification, class and scenario modeling, state modeling, UML, design patterns, traceability. Students are to complete a team project using a CASE tool.", "\n"], "title": "Oriented Software Engineering", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduces students to concepts of database management systems, database design and file structures. Topics include: entity-relationship modeling and object oriented database design, data models (relational, network and object oriented), the relational algebra, SQL, normalization theory, physical data organization, object oriented databases and OQL.", "\n"], "title": "Database Management Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to alternative programming paradigms such as functional, constraint-based, concurrent, and logic programming.", "\n"], "title": "Programming Paradigms", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3007"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamentals of the underlying theories, design principles, development and evaluation practices of human-computer interaction (HCI). Topics may include: theories of interaction, user interface frameworks, desktop, web, mobile, and immersive applications, usability inspection and testing methods, and qualitative and quantitative approaches to HCI research.", "\n"], "title": "Computer Interaction", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3008"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn overview of computer graphics covering rendering, modeling, and animation. Topics include geometric primitives and modeling; image formation algorithms such as ray tracing and the Z-buffer; lighting, shading, and texture; and introduction to physics-based animation and character animation.", "\n"], "title": "Computer Graphics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThis is an introductory course to the field of Network Computing. Topics include: Protocol Architectures and Internetworking, Types of Networks, Communication Protocols, End-System and Network Traffic Management, Structure of Routing and Congestion Control.", "\n"], "title": "Principles of Computer Networks", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTechnical communication for computer science majors, concentrating on writing scientific papers and technical reports. Principles of clarity and precision in writing and communication. Practical exercises and readings from recent technical publications will be used.", "\n"], "title": "Technical Writing for Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3301"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 3008"], "description": ["\n", "\nThis practical interdisciplinary course will provide a broad overview of bioinformatics in which computer science and mathematics are applied to solve problems in molecular biology. Topics include gene prediction, sequence alignment, phylogeny, molecular interactions, macromolecular structure prediction and biological databases.", "\n"], "title": "Bioinformatics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplications of formal logic in computer science. Symbolic logics such as classical predicate calculus are used to represent domain knowledge, to model computational problems and to solve them by means of automated reasoners. Applications include artificial intelligence, software engineering, data management and hardware verification.", "\n"], "title": "Computational Logic and Automated Reasoning", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3400"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nMathematical concepts of 3D engines. Topics may include: illumination and visibility determination; quaternions; homogeneous coordinates; transforms; ray tracing; bump mapping; portal systems; polygonal techniques; shadows; and linear and rotational physics.", "\n"], "title": "Foundations of Game Programming and Computer Graphics", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to virtual communities, overlay networks and social networking. Topics include architectural principles for heterogeneous social networking platforms, trust and reputation as social concepts, agent-based computing, and extraction of trends and patterns from information exchanged between community members.", "\n"], "title": "Social Networking", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAlgorithm design techniques for modern data sets arising in, for example, data mining, web analytics, epidemic spreads, search engines and social networks. Topics may include streaming, memory hierarchy aware, game theoretic, parallel, distributed, cloud-based, and probabilistic algorithms.", "\n"], "title": "Algorithms for Modern Data Sets", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3801"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational geometry focusing on applications to autonomous mobile robots. Topics may include planning, probabilistic roadmaps, search strategies, coverage algorithms, watchman routes, vision-based landmark identification and multi-robot applications.", "\n"], "title": "Computational Geometry", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3802"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheoretical aspects of computer science. Topics include: formal languages and automata theory, computability theory.", "\n"], "title": "Introduction to Theory of Computation", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3803"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3804"], "description": ["\n", "\nAn introduction to the design and analysis of algorithms. Topics include: divide-and-conquer, dynamic programming, linear programming, greedy algorithms, graph algorithms, NP-completeness.", "\n"], "title": "Design and Analysis of Algorithms I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3855"], "description": ["\n", "\nEnumeration: inclusion and exclusion, recurrence relations, generating functions and applications. Graph theory: connectivity, planarity, Hamilton paths and Euler trails. Error-correcting codes. Designs and finite geometries. Symmetry and counting.", "\n"], "title": "", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3806"], "description": ["\n", "\nElementary discussion of error, polynomial interpolation, quadrature, linear systems of equations and matrix inversion, non-linear equations, difference equations and ordinary differential equations.", "\n"], "title": "Numerical Analysis", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3806"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3807"], "description": ["\n", "\nIncorporation of basic numerical methods into efficient, reliable software. The course includes examination of existing software systems, e.g. linear systems, non-linear systems, optimization, or differential equations.", "\n"], "title": "Mathematical Software", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\n"], "title": "operative Work Term", "prerequisites": [], "credit": ["0.0"], "code": ["COMP 3999"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn advanced course emphasizing the principles of distributed operating systems including networking protocols, distributed file systems, remote IPC mechanisms, graphical user interfaces, load balancing, and process migration. Case studies include current \"standards\" as well as novel systems under development.", "\n"], "title": "Distributed Operating Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOverview of distributed computing. Topics include: computational models, communication complexity, design and analysis of distributed algorithms and protocols, fault-tolerant protocols, synchronous computations. Applications may include: communication in data networks, control in distributed system (e.g., election, distributed mutual exclusion), manipulation of distributed data (e.g., ranking).", "\n"], "title": "Distributed Computing", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe design and implementation of game engines for real-time 3D games including topics such as camera control, environmental effects, articulated models, terrain, vegetation, collision detection, particles, emitters, triggers, portals, waypoints, mirrors, and shadows.", "\n"], "title": "Time 3D Game Engines", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nConcepts and architectures of transaction processing systems and on-line transaction processing, with emphasis on data integration systems. Transaction properties and models, embedded-SQL, active rules, consistency maintenance, serializability, concurrency control, recovery, data integration systems and federated databases, introduction to transactions in web services and workflow systems.", "\n"], "title": "Transaction Processing Systems", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4003"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and practice of Software Quality Assurance. Topics include: functional requirements analysis, system requirement analysis, verification and validation, traceability, white box testing, integration testing, object-oriented testing, tools, and management issues.", "\n"], "title": "Software Quality Assurance", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to parallel architectures, programming languages and algorithms for processor clusters and multi-core processors. Distributed memory architectures, cluster computing, message passing parallel programming, multi-core processors, shared memory parallel programming, use of thread libraries, parallel performance analysis.", "\n"], "title": "Core Processors", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe basic ideas and techniques of computer vision. The central theme is reconstructing 3D models from 2D images. Topics include: image formation, image feature extraction, camera models, camera calibration, structure from motion, stereo, recognition, augmented reality, image searching.", "\n"], "title": "Computer Vision", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4102"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAdvanced course on distributed programming in Java. Introduces students to standard design patterns for implementing components that solve common distributed programming challenges in Java. Topics covered include: threads, message passing, coordination, distributed object technology, web-based services, and collaborative applications.", "\n"], "title": "Principles and Practice of Distributed Programming", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4104"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSeveral areas in knowledge-based systems are covered, including recent approaches to machine learning and data mining, inference methods, knowledge-based and fuzzy systems, heuristic search, and natural language processing.", "\n"], "title": "Artificial Intelligence", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4106"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and application of naturally-occurring systems for the purpose of creating computer algorithms. Topics from evolutionary computing, swarm intelligence, neural networks and artificial immune systems will be studied.", "\n"], "title": "Inspired Computing", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4107"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to information security in computer and communications systems, including network, operating systems, web and software security; Passwords, authentication applications, privacy, data integrity, anonymity, secure email, IP security, security infrastructures, firewalls, viruses, intrusion detection, network attacks.", "\n"], "title": "Computer Systems Security", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4108"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nPractical aspects of cryptography. Pseudo random number generation, symmetric cryptography (stream and block ciphers), modes of operation, hash functions, message and entity authentication protocols, zero knowledge, pitfalls deploying public-key encryption and digital signatures, key distribution, secret-sharing.", "\n"], "title": "Applied Cryptography", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4109"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplication of computational techniques to support business activities, such as decision making, business understanding, data analysis, business process automation, learning from data, producing and using data-centric business models, ontology-based data access and integration, data quality assessment and cleaning and use of contextual data.", "\n"], "title": "Data Management for Business Intelligence", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4111"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to wireless networks covering both networking issues and security aspects of modern wireless environments. Fundamentals of mobile LANs, ad hoc, sensor networks, secure routing, searching, clustering, multicasting, localization, mobile IP/TCP, confidentiality, key establishment, authentication, broadcasting, RFIDs, and rogue attacks.", "\n"], "title": "Wireless Networks and Security", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamental mathematical and algorithmic concepts underlying molecular computational biology; physical and genetic mapping, sequence analysis (including alignment and probabilistic models), genomic rearrangements, phylogenetic inference, computational proteomics and systemic modeling of the whole cell.", "\n"], "title": "Computational Molecular Biology", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4300"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 4008"], "description": ["\n", "\nModeling and simulation of metabolic and regulatory networks towards understanding complex and highly dynamic cellular systems. Biotechnological applications include metabolic engineering, synthetic biology, and drug discovery.", "\n"], "title": "Computational Systems Biology", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected computer game topics including: networked games; online games; high performance computing for game development; high resolution scenes; massively multiplayer online games (MMOG); advanced character development; facial modeling and animation; the computer games marketplace and business models.", "\n"], "title": "Advanced Computer Game Design and Development", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the creation, delivery and playback of multimedia over high-speed wireless networks on mobile devices. Topics include human computer interaction, standards, interaction with networking aspects, security, video streaming, gaming, navigation and context aware services, and immersive communications in virtual environments.", "\n"], "title": "Mobile Multimedia", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4803"], "description": ["\n", "\nRecursive functions and computability, algorithms, Church's thesis, Turing machines, computational logic, NP-completeness.", "\n"], "title": "Computable Functions", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4803"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course on the design and analysis of algorithms. Topics include: advanced recurrence relations, algebraic complexity, advanced graph algorithms, amortized analysis, algorithms for NP-complete problems, randomized algorithms.", "\n"], "title": "Design and Analysis of Algorithms II", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4805"], "description": ["\n", "\nFinite automata and regular expressions, properties of regular sets, context-free grammars, pushdown automata, deterministic context-free languages. Turing machines, the Chomsky hierarchy. Undecidability, intractable problems.", "\n"], "title": "Theory of Automata", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4806"], "description": ["\n", "\nStudy of matrix inversion techniques; techniques of finding eigenvalues and eigenvectors, solution of systems of linear equations; direct and indirect methods, their comparison and error analysis; applications in optimization and other areas.", "\n"], "title": "Numerical Linear Algebra", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4806"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected topics in Computer Science offered by members of the School of Computer Science.", "\n"], "title": "Advanced Topics in Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4900"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA course of independent study under the supervision of a member of the School of Computer Science, open only to students in the B.C.S. program. Students are required to obtain their supervisor's written approval prior to registration and are limited to two such courses in their programs.", "\n"], "title": "Directed Studies", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4901"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nUnder the supervision of a faculty member, Honours students complete a major Computer Science project in fourth year. Permission to register is granted once an approved project proposal is submitted to the Department. See deadlines and details on the School web site.", "\n"], "title": "Honours Project", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 4905"]}][[{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational thinking and its applications to the arts and social sciences.  Students will gain computational thinking skills by exploring data representation, basic programming concepts, a selection of algorithms, and advanced usage of software packages for the arts and social sciences.", "\n"], "title": "Introduction to Computational Thinking for Arts and Social Science Students", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nWorking knowledge of computers and their applications with particular reference to problems in Science. Computer fundamentals and the use of application packages such as spreadsheets, databases and symbolic Mathematics programs. A basic familiarity with computers is assumed.", "\n"], "title": "Introduction to Computers for the Sciences", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming, emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 1005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 1006"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA first course in programming for B.C.S. students emphasizing problem solving and computational thinking. Topics include pseudocode, variables, conditionals, iteration, arrays, objects, functions, sorting, searching, and simulation.", "\n"], "title": "Introduction to Computer Science I", "prerequisites": ["Prerequisite(s): restricted to students registered in the B.C.S. program, combined Honours in Computer Science and Mathematics, Honours Computer Mathematics, and Honours Computer Statistics."], "credit": ["0.5"], "code": ["COMP 1405"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in programming for BCS students, emphasizing problem solving and computational thinking in an object-oriented language. Topics include abstraction, mutable data structures, methods, inheritance, polymorphism, recursion, program efficiency, testing and debugging.", "\n"], "title": "Introduction to Computer Science II", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 1406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to computer game programming interfaces. Topics may include: game balance and level design; storytelling and narrative; basic game architecture; sprite-based games and isometric games; representation of scenes; user interaction; architecture of game consoles; development tools for game consoles; interaction with game peripherals.", "\n"], "title": "Introduction to Computer Game Design", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 1501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to developing mobile applications using the Mac OS X platform.  Topics include: the Objective-C programming language; development tools; framework API's; and the Quartz graphic system. Extensive practical experience with development for Apple mobile devices such as the iPhone.", "\n"], "title": "Introduction to Mobile Application Development", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 1601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 1805"], "description": ["\n", "\nIntroduction to discrete mathematics and discrete structures. Topics include: propositional logic, predicate calculus, set theory, complexity of algorithms, mathematical reasoning and proof techniques, recurrences, induction, finite automata and graph theory. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures I", "prerequisites": ["Prerequisite(s): one Grade 12 university preparation mathematics course."], "credit": ["0.5"], "code": ["COMP 1805"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to the field of mobile robots and their applications from a computer science perspective.  The course will discuss common robot programming architectures and strategies. Students will build various robot configurations and experiment with a variety of sensors using behavior-based programming.", "\n"], "title": "Introduction to Robotics", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 1807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to system-level programming with fundamental OS concepts, procedures, primitive data types, user-defined types. Topics may include process management, memory management, process coordination and synchronization, inter-process communication, file systems, networking, pointers, heap and stack memory management, and system/library calls.", "\n"], "title": "Introduction to Systems Programming", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 2401"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the design and implementation of abstract data types and to complexity analysis of data structures. Topics include: stacks, queues, lists, trees and graphs. Special attention is given to abstraction, interface specification and hierarchical design using an object-oriented programming language.", "\n"], "title": "Abstract Data Types and Algorithms", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 2402"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to object-oriented software development, with emphasis on design and implementation of medium-sized programs. Topics include abstraction, modularity, encapsulation, reusability, and design patterns.", "\n"], "title": "Introduction to Software Engineering", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 2404"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to Internet application development; emphasis on computer science fundamentals of technologies underlying web applications. Topics include: scripting and functional languages, language-based virtual machines, database query languages, remote procedure calls over the Internet, and performance and security concerns in modern distributed applications.", "\n"], "title": "Fundamentals of Web Applications", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 2406"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTopics may include: user interaction in multiplayer games, representation of animated scenes, tools for game character development, special effects,  sound programming, game AI,  motion planning and control, collision detection and physics, digital rights management.", "\n"], "title": "Computer Game Design and Development", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 2501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nDevelopment of applications for mobile environments taking advantage of gesture-based input and using location and presence services. Topics include introduction to low-level network services and mobile platforms, description of architectural patterns, principles of mobile development and interaction styles for network service usage.", "\n"], "title": "Mobile Applications", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 2601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course in discrete mathematics and discrete structures. Topics include: counting, sequences and sums, discrete probability, basic statistics, recurrence relations, randomized algorithms. Material is illustrated through examples from computing.", "\n"], "title": "Discrete Structures II", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 2804"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA continuation of ", ", this course will focus on data uncertainty and various timing issues inherent to the field of mobile robot programming. Topics may include position estimation, forward/inverse kinematics, navigation, data-logging, mapping and robot-computer interaction through wireless communication.", "\n"], "title": "Fundamentals of Mobile Robot Programming", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 2807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOperating system implementation course stressing fundamental issues in design and how they relate to modern computer architectures. Assignments involve the modification and extension of a multitasking operating system.", "\n"], "title": "Operating Systems", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe structure, organization and design of the phases of a compiler are considered: lexical translators, syntactical translators, scope handlers, type checkers, code generators and optimizers. Components of a compiler will be implemented.", "\n"], "title": "Compiler Construction", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheory and development software systems. Computer ethics. Possible topics include: software development processes, requirement specification, class and scenario modeling, state modeling, UML, design patterns, traceability. Students are to complete a team project using a CASE tool.", "\n"], "title": "Oriented Software Engineering", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduces students to concepts of database management systems, database design and file structures. Topics include: entity-relationship modeling and object oriented database design, data models (relational, network and object oriented), the relational algebra, SQL, normalization theory, physical data organization, object oriented databases and OQL.", "\n"], "title": "Database Management Systems", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3005"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to alternative programming paradigms such as functional, constraint-based, concurrent, and logic programming.", "\n"], "title": "Programming Paradigms", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3007"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamentals of the underlying theories, design principles, development and evaluation practices of human-computer interaction (HCI). Topics may include: theories of interaction, user interface frameworks, desktop, web, mobile, and immersive applications, usability inspection and testing methods, and qualitative and quantitative approaches to HCI research.", "\n"], "title": "Computer Interaction", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3008"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn overview of computer graphics covering rendering, modeling, and animation. Topics include geometric primitives and modeling; image formation algorithms such as ray tracing and the Z-buffer; lighting, shading, and texture; and introduction to physics-based animation and character animation.", "\n"], "title": "Computer Graphics", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThis is an introductory course to the field of Network Computing. Topics include: Protocol Architectures and Internetworking, Types of Networks, Communication Protocols, End-System and Network Traffic Management, Structure of Routing and Congestion Control.", "\n"], "title": "Principles of Computer Networks", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTechnical communication for computer science majors, concentrating on writing scientific papers and technical reports. Principles of clarity and precision in writing and communication. Practical exercises and readings from recent technical publications will be used.", "\n"], "title": "Technical Writing for Computer Science", "prerequisites": [], "credit": ["0.5"], "code": ["COMP 3301"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 3008"], "description": ["\n", "\nThis practical interdisciplinary course will provide a broad overview of bioinformatics in which computer science and mathematics are applied to solve problems in molecular biology. Topics include gene prediction, sequence alignment, phylogeny, molecular interactions, macromolecular structure prediction and biological databases.", "\n"], "title": "Bioinformatics", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplications of formal logic in computer science. Symbolic logics such as classical predicate calculus are used to represent domain knowledge, to model computational problems and to solve them by means of automated reasoners. Applications include artificial intelligence, software engineering, data management and hardware verification.", "\n"], "title": "Computational Logic and Automated Reasoning", "prerequisites": ["Prerequisite(s): COMP/"], "credit": ["0.5"], "code": ["COMP 3400"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nMathematical concepts of 3D engines. Topics may include: illumination and visibility determination; quaternions; homogeneous coordinates; transforms; ray tracing; bump mapping; portal systems; polygonal techniques; shadows; and linear and rotational physics.", "\n"], "title": "Foundations of Game Programming and Computer Graphics", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to virtual communities, overlay networks and social networking. Topics include architectural principles for heterogeneous social networking platforms, trust and reputation as social concepts, agent-based computing, and extraction of trends and patterns from information exchanged between community members.", "\n"], "title": "Social Networking", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3601"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAlgorithm design techniques for modern data sets arising in, for example, data mining, web analytics, epidemic spreads, search engines and social networks. Topics may include streaming, memory hierarchy aware, game theoretic, parallel, distributed, cloud-based, and probabilistic algorithms.", "\n"], "title": "Algorithms for Modern Data Sets", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3801"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to computational geometry focusing on applications to autonomous mobile robots. Topics may include planning, probabilistic roadmaps, search strategies, coverage algorithms, watchman routes, vision-based landmark identification and multi-robot applications.", "\n"], "title": "Computational Geometry", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3802"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nTheoretical aspects of computer science. Topics include: formal languages and automata theory, computability theory.", "\n"], "title": "Introduction to Theory of Computation", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3803"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3804"], "description": ["\n", "\nAn introduction to the design and analysis of algorithms. Topics include: divide-and-conquer, dynamic programming, linear programming, greedy algorithms, graph algorithms, NP-completeness.", "\n"], "title": "Design and Analysis of Algorithms I", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 3804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3855"], "description": ["\n", "\nEnumeration: inclusion and exclusion, recurrence relations, generating functions and applications. Graph theory: connectivity, planarity, Hamilton paths and Euler trails. Error-correcting codes. Designs and finite geometries. Symmetry and counting.", "\n"], "title": "", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3806"], "description": ["\n", "\nElementary discussion of error, polynomial interpolation, quadrature, linear systems of equations and matrix inversion, non-linear equations, difference equations and ordinary differential equations.", "\n"], "title": "Numerical Analysis", "prerequisites": ["Prerequisite(s): i) "], "credit": ["0.5"], "code": ["COMP 3806"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 3807"], "description": ["\n", "\nIncorporation of basic numerical methods into efficient, reliable software. The course includes examination of existing software systems, e.g. linear systems, non-linear systems, optimization, or differential equations.", "\n"], "title": "Mathematical Software", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 3807"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\n"], "title": "operative Work Term", "prerequisites": [], "credit": ["0.0"], "code": ["COMP 3999"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn advanced course emphasizing the principles of distributed operating systems including networking protocols, distributed file systems, remote IPC mechanisms, graphical user interfaces, load balancing, and process migration. Case studies include current \"standards\" as well as novel systems under development.", "\n"], "title": "Distributed Operating Systems", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 4000"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nOverview of distributed computing. Topics include: computational models, communication complexity, design and analysis of distributed algorithms and protocols, fault-tolerant protocols, synchronous computations. Applications may include: communication in data networks, control in distributed system (e.g., election, distributed mutual exclusion), manipulation of distributed data (e.g., ranking).", "\n"], "title": "Distributed Computing", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4001"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe design and implementation of game engines for real-time 3D games including topics such as camera control, environmental effects, articulated models, terrain, vegetation, collision detection, particles, emitters, triggers, portals, waypoints, mirrors, and shadows.", "\n"], "title": "Time 3D Game Engines", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 4002"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nConcepts and architectures of transaction processing systems and on-line transaction processing, with emphasis on data integration systems. Transaction properties and models, embedded-SQL, active rules, consistency maintenance, serializability, concurrency control, recovery, data integration systems and federated databases, introduction to transactions in web services and workflow systems.", "\n"], "title": "Transaction Processing Systems", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4003"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and practice of Software Quality Assurance. Topics include: functional requirements analysis, system requirement analysis, verification and validation, traceability, white box testing, integration testing, object-oriented testing, tools, and management issues.", "\n"], "title": "Software Quality Assurance", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4004"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to parallel architectures, programming languages and algorithms for processor clusters and multi-core processors. Distributed memory architectures, cluster computing, message passing parallel programming, multi-core processors, shared memory parallel programming, use of thread libraries, parallel performance analysis.", "\n"], "title": "Core Processors", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4009"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nThe basic ideas and techniques of computer vision. The central theme is reconstructing 3D models from 2D images. Topics include: image formation, image feature extraction, camera models, camera calibration, structure from motion, stereo, recognition, augmented reality, image searching.", "\n"], "title": "Computer Vision", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 4102"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAdvanced course on distributed programming in Java. Introduces students to standard design patterns for implementing components that solve common distributed programming challenges in Java. Topics covered include: threads, message passing, coordination, distributed object technology, web-based services, and collaborative applications.", "\n"], "title": "Principles and Practice of Distributed Programming", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4104"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSeveral areas in knowledge-based systems are covered, including recent approaches to machine learning and data mining, inference methods, knowledge-based and fuzzy systems, heuristic search, and natural language processing.", "\n"], "title": "Artificial Intelligence", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 4106"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the theory and application of naturally-occurring systems for the purpose of creating computer algorithms. Topics from evolutionary computing, swarm intelligence, neural networks and artificial immune systems will be studied.", "\n"], "title": "Inspired Computing", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4107"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to information security in computer and communications systems, including network, operating systems, web and software security; Passwords, authentication applications, privacy, data integrity, anonymity, secure email, IP security, security infrastructures, firewalls, viruses, intrusion detection, network attacks.", "\n"], "title": "Computer Systems Security", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 4108"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nPractical aspects of cryptography. Pseudo random number generation, symmetric cryptography (stream and block ciphers), modes of operation, hash functions, message and entity authentication protocols, zero knowledge, pitfalls deploying public-key encryption and digital signatures, key distribution, secret-sharing.", "\n"], "title": "Applied Cryptography", "prerequisites": ["Prerequisite(s): one of "], "credit": ["0.5"], "code": ["COMP 4109"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nApplication of computational techniques to support business activities, such as decision making, business understanding, data analysis, business process automation, learning from data, producing and using data-centric business models, ontology-based data access and integration, data quality assessment and cleaning and use of contextual data.", "\n"], "title": "Data Management for Business Intelligence", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4111"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nAn introduction to wireless networks covering both networking issues and security aspects of modern wireless environments. Fundamentals of mobile LANs, ad hoc, sensor networks, secure routing, searching, clustering, multicasting, localization, mobile IP/TCP, confidentiality, key establishment, authentication, broadcasting, RFIDs, and rogue attacks.", "\n"], "title": "Wireless Networks and Security", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4203"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nFundamental mathematical and algorithmic concepts underlying molecular computational biology; physical and genetic mapping, sequence analysis (including alignment and probabilistic models), genomic rearrangements, phylogenetic inference, computational proteomics and systemic modeling of the whole cell.", "\n"], "title": "Computational Molecular Biology", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4300"]},
{"precludes_credit_for": [], "also_listed_as": ["BIOC 4008"], "description": ["\n", "\nModeling and simulation of metabolic and regulatory networks towards understanding complex and highly dynamic cellular systems. Biotechnological applications include metabolic engineering, synthetic biology, and drug discovery.", "\n"], "title": "Computational Systems Biology", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4308"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected computer game topics including: networked games; online games; high performance computing for game development; high resolution scenes; massively multiplayer online games (MMOG); advanced character development; facial modeling and animation; the computer games marketplace and business models.", "\n"], "title": "Advanced Computer Game Design and Development", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4501"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nIntroduction to the creation, delivery and playback of multimedia over high-speed wireless networks on mobile devices. Topics include human computer interaction, standards, interaction with networking aspects, security, video streaming, gaming, navigation and context aware services, and immersive communications in virtual environments.", "\n"], "title": "Mobile Multimedia", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4601"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4803"], "description": ["\n", "\nRecursive functions and computability, algorithms, Church's thesis, Turing machines, computational logic, NP-completeness.", "\n"], "title": "Computable Functions", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4803"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA second course on the design and analysis of algorithms. Topics include: advanced recurrence relations, algebraic complexity, advanced graph algorithms, amortized analysis, algorithms for NP-complete problems, randomized algorithms.", "\n"], "title": "Design and Analysis of Algorithms II", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4804"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4805"], "description": ["\n", "\nFinite automata and regular expressions, properties of regular sets, context-free grammars, pushdown automata, deterministic context-free languages. Turing machines, the Chomsky hierarchy. Undecidability, intractable problems.", "\n"], "title": "Theory of Automata", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4805"]},
{"precludes_credit_for": [], "also_listed_as": ["MATH 4806"], "description": ["\n", "\nStudy of matrix inversion techniques; techniques of finding eigenvalues and eigenvectors, solution of systems of linear equations; direct and indirect methods, their comparison and error analysis; applications in optimization and other areas.", "\n"], "title": "Numerical Linear Algebra", "prerequisites": ["Prerequisite(s): "], "credit": ["0.5"], "code": ["COMP 4806"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nSelected topics in Computer Science offered by members of the School of Computer Science.", "\n"], "title": "Advanced Topics in Computer Science", "prerequisites": ["Prerequisite(s): permission of the School of Computer Science."], "credit": ["0.5"], "code": ["COMP 4900"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nA course of independent study under the supervision of a member of the School of Computer Science, open only to students in the B.C.S. program. Students are required to obtain their supervisor's written approval prior to registration and are limited to two such courses in their programs.", "\n"], "title": "Directed Studies", "prerequisites": ["Prerequisite(s): permission of the School of Computer Science."], "credit": ["0.5"], "code": ["COMP 4901"]},
{"precludes_credit_for": [], "also_listed_as": [], "description": ["\n", "\nUnder the supervision of a faculty member, Honours students complete a major Computer Science project in fourth year. Permission to register is granted once an approved project proposal is submitted to the Department. See deadlines and details on the School web site.", "\n"], "title": "Honours Project", "prerequisites": ["Prerequisite(s): registration in the B.C.S. Honours program or one of the Combined Computer Science Honours programs and permission of the School of Computer Science."], "credit": ["0.5"], "code": ["COMP 4905"]}]